/***********************************************************/
// [10-1] 배열명에 정수 연산을 수행해 배열 요소 사용
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int array[3]; // 3칸 배열 총 12byte.

    printf("%d\n", array);
    printf("%d\n",&array[0]);
    printf("%d\n", (array + 1));

    array[0] = 10;
    *(array + 1) = 20;
    // *(array + 3) = 10; 처럼 범위를 벗어난 주소 사용 금지

    for(int i = 0; i < 3; i++){
        printf("%d번째 요소 : %d ", i, array[i]);
    }

	return 0;
}
#endif

/***********************************************************/
// [10-2] 배열명처럼 사용되는 포인터
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int array[3];
    int *pa = array;

    *pa = 10;
    // 20을 배열 두 번째 요소(인덱스 1)에 할당
    //1.
    //  array[1] = 20;
    
    //2.
    //  *(array + 1) = 20;
    
    //3.
    //  *(pa + 1) = 20;
    
    //4.
    //  pa++, *pa = 20;

    for(int i = 0; i < 3; i++){
        printf("%d번째 요소 : %d ", i, array[i] );
    }
    printf("\n");

    printf("배열 전체의 길이 : %d\n", sizeof(array));
    printf("포인터 하나의 길이 : %d\n", sizeof(pa));
    

	return 0;
}
#endif

/***********************************************************/
// [10-3] 포인터를 이용한 배열의 값 출력
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
    int array[3] = {10, 20, 30};
    int *pa = array;

    printf("배열의 값 : ");
    for(int i = 0; i < 3 ; i++){
        //printf("%d ", array[i]);
        
        // printf("%d ", *pa);
        // pa++;

        printf("%d ", *(pa++)); //후위 증감 연산자 사용시 주소 값을 확인하여 벗어났는지 체크
        // printf("%d ", *(++pa)); // 전위 증감 연산을 쓸경우 원하는 결과를 얻을수 없을 수 있다.
    }
    pa = array; // pa를 재사용을 할경우 다시 주소값을 할당 필요

	return 0;
}
#endif

/***********************************************************/
// [10-4] 포인터의 뺼셈과 관계 연산
/***********************************************************/

#if 1
#include <stdio.h>

int main(void)
{
    

	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif