/***********************************************************/
// [4-1] 대입, 더하기, 빼기, 곱하기, 음수 연산
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int a, b;

	a = 10;
	b = 20;

	printf("%d + %d = %d\n", a, b, a + b);
	printf("%d - %d = %d\n", a, b, a - b);
	printf("%d * %d = %d\n", a, b, a * b);
	printf("%d\n", -a);

	return 0;
}
#endif

/***********************************************************/
// [4-2] 나누기 나머지 연산자
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	double apple;
	int banana, orange;

	apple = 5.0 / 2.0;
	printf("%lf\n", apple);
	// 1. 우항 먼저 실행 5.0 / 2.0
	// 2. 우항 연산 : 실수 / 실수 -> 실수
	// 3. 실수 결과를 apple에 대입

	banana = 5 / 2;
	printf("%d\n", banana);
	// 1. 우항 먼저 실행 5 / 2
	// 2. 우항 연산 : 정수 / 정수 -> 정수
	// 3. 정수 결과를 banana에 대입

	orange = 5 % 2;
	printf("%d\n", orange);


	return 0;
}
#endif

/***********************************************************/
// [4-2-1] (실습) 최소 동전 구하기
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	// 자판기에 동전을 투입
	// 잔돈을 출력하는 프로그램
	int input = 770;
	int price = 100; // 아침햇살
	int change = input - price;
	// change : 900
	// ====출력문구====
	// 50원짜리 : 1개
	// 10원짜리 : 2개
	printf("잔돈 : %d원\n", change);
	printf("500원짜리 : %d개\n", change / 500);
	printf("100원짜리 : %d개\n", change % 500 / 100);
	// change - 500 * 500원개수 - 100 * 100원개수
	// => 770 % 100 : 70
	printf("50원짜리 : %d개\n", change % 100 / 50);
	printf("10원짜리 : %d개\n", change % 50 / 10);
	return 0;
}
#endif

/***********************************************************/
// [4-2-2] (실습) 주어진 초를 시간으로 계산
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int time = 7533; // 총 초(seconds)의 수가 주어진다
	// ====출력 결과====
	// 2시간 5분 33초
	int h, m, s;
	h = time / (60 * 60);
	m = time % (60 * 60) / 60;
	s = time % (60 * 60) % 60;
	printf("%d시 %d분 %d초", h, m, s);
	return 0;
}
#endif

/***********************************************************/
// [4-4] 전위 표기와 후위 표기를 사용한 증감 연산
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	int a = 5, b = 5;
	int prefix, postfix;
	prefix = (++a) * 3;
	postfix = (b++) * 3;
	printf("%d %d\n", prefix, postfix);
	printf("%d %d\n", a, b);
	
	return 0;
}
#endif

/***********************************************************/
// [4-5] 관계 연산의 결괏값 확인
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	// 0 이외의 모든 정수는 참의 역할
	// 1 = 참, 0 = 거짓
	int a = 10, b = 20, c =10;
	int result;

	result = (a > b);
	printf("a > b : %d\n", result);

	result = (a >= b);
	printf("a >= b : %d\n", result);

	result = (a < b);
	printf("a < b : %d\n", result);

	result = (a <= b);
	printf("a <= b : %d\n", result);

	result = (a == b);
	printf("a == b : %d\n", result);

	result = (a != b);
	printf("a != b : %d\n", result);

	return 0;
}
#endif

/***********************************************************/
// [4-6] 논리 연산의 결괏값 확인
/***********************************************************/

#if 1
#include <stdio.h>

int main(void)
{
	// && (AND) : 논리곱
	// || (OR) : 논리합
	// ! (NOT) : 논리 부정
	int a = 30;
	int result;

	result = (a > 10) && (a < 20);
	printf("(a > 10) && (a < 20) = %d\n", result);

	result = (a < 10) || (a > 20);
	printf("(a < 10) || (a > 20) = %d\n", result);

	result = !(a >= 30);
	printf("!(a >= 30) = %d\n", result);
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif

/***********************************************************/
// [0-0] 타이틀
/***********************************************************/

#if 0
#include <stdio.h>

int main(void)
{
	
	return 0;
}
#endif